Documents/DMS_ЗаявкаНаАвтомобиль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_ЗаявкаНаАвтомобиль</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BIR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataAra</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumCl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерDMS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерDevis</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ВариантыСалона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЖелаемойПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммерческаяАкция1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_КоммерческиеАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммерческаяАкция2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_КоммерческиеАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммерческаяАкция3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_КоммерческиеАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммерческаяАкция4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_КоммерческиеАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммерческаяАкция5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_КоммерческиеАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Опции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродавецСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируемВMyRenault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаКоммуникацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветСалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ЦветаСалона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОрдера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрикрепления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрепления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аннулирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАннуляции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбычнаяСделка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конверсия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лизинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кузовостроитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛизинговаяКомпания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерепродажаОформлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируемВКорпПортале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтрокиДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентрализованныйКонтракт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_ТарифНаОпцииАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТарифНаОпцииАвтомобилей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаКлиентская</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаДилерская</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Базовая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДоступенКорпКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОпции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТарифыНаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Опция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Опции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/DMS_ЗаявкаНаАвтомобиль/Forms/ФормаКонфигуратора/Ext/Form/Module.bsl
&НаКлиенте
Перем РезультатПолученияДопИнформации;
&НаКлиенте
Перем ФормаДлительнойОперации;
&НаКлиенте
Перем ПараметрыОбработчика;

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокМоделей()
	
	Бренд = ПараметрыСеанса.DMS_Бренд;
	
	Если ЗначениеЗаполнено(Бренд) Тогда
		МаркаРено = Бренд;
	Иначе
		МаркаРено = CRM_Сервер.ПолучитьМаркуRenault();
	КонецЕсли;
	
	МассивМарок = Новый Массив;
	Если Не МаркаРено.Пустая() Тогда
		МассивМарок = МаркаРено.МоделиАвтомобилейКоммерческоеПредложение.ВыгрузитьКолонку("Модель");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ПустаяСтрока КАК Модель,
	               |	"""" КАК Наименование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Модели.Ссылка,
	               |	Модели.Наименование
	               |ИЗ
	               |	Справочник.Модели КАК Модели
	               |ГДЕ
	               |	Модели.Ссылка В(&МассивМарок)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	Запрос.УстановитьПараметр("ПустаяСтрока", Справочники.Модели.ПустаяСсылка());
	Запрос.УстановитьПараметр("МассивМарок", МассивМарок);
	Таблица = Запрос.Выполнить().Выгрузить();
	ТаблицаМодели.Загрузить(Таблица);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ТекущийТариф = Renault_ОбщегоНазначенияНаСервере.ПолучитьТекущийТарифНаАвтомобили();
	ТекущийТариф = Renault_CRM.ПолучитьТекущийТарифНаАвтомобили();
	
	Если Параметры.Свойство("Модель") Тогда
		Модель = Параметры.Модель; 
		ТипАвтомобиля = Перечисления.DMS_ТипыАвтомобилей.VP;
		//Если Модель.Артикул = "MAU" или Модель.Артикул = "TFU" Тогда
		//	ТипАвтомобиля = Перечисления.ТипыАвтомобилей.VU;
		//КонецЕсли;
	Иначе
		Модель = Справочники.Модели.ПустаяСсылка();
	КонецЕсли;
	Если Параметры.Свойство("Версия") Тогда
		Версия = Параметры.Версия;
	Иначе 
		Версия = Справочники.ВариантыКомплектации.ПустаяСсылка();
	КонецЕсли;
	Если Параметры.Свойство("Цвет") Тогда
		Цвет = Параметры.Цвет;
	Иначе
		Цвет = Справочники.Цвета.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Модель) и ЗначениеЗаполнено(Версия) Тогда
		Если Параметры.Свойство("Опции") Тогда
			Опции = Параметры.Опции;
			ЗаполнитьТаблицуОпций ();
		КонецЕсли;
		Если Параметры.Свойство("Салон") Тогда
			ЭтаФорма.ВариантСалона = Параметры.Салон;
		КонецЕсли;
		Если Параметры.Свойство("ЦветСалона") Тогда
			ЭтаФорма.ЦветСалона = Параметры.ЦветСалона;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("VIN") Тогда
		Элементы.ВыбранныеНебазовыеОпцииВыбран.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОпций ()
	Запрос = Новый Запрос;

	//Если ЭтоТрейдИН Тогда
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Renault_ОпцииАвтомобилей.Опция КАК Опция,
	//	|	Renault_ОпцииАвтомобилей.Цена КАК Цена,
	//	|	Renault_ОпцииАвтомобилей.Код КАК КодОпции,
	//	|	Renault_ОпцииАвтомобилей.Наименование КАК НаименованиеОпции,
	//	|	ИСТИНА КАК Выбран
	//	|ИЗ
	//	|	РегистрСведений.Renault_ОпцииАвтомобилей КАК Renault_ОпцииАвтомобилей
	//	|ГДЕ
	//	|	Renault_ОпцииАвтомобилей.VIN = &VIN";
	//	Запрос.УстановитьПараметр("VIN", Автомобиль.VIN);
	//	
	//иначе
		
		Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
		//Запрос.УстановитьПараметр("УжеВыбрано", ВыбранныеНебазовыеОпции.Выгрузить());
		//Запрос.УстановитьПараметр("УжеВыбрано", Элементы.БазовыеОпции.Опции.Выгрузить());
		Запрос.УстановитьПараметр("Модель", Модель);
		Запрос.УстановитьПараметр("ВариантКомплектации", Версия);
		Запрос.Текст =
		//"ВЫБРАТЬ
		//|	ИСТИНА КАК Выбран,
		//|	ВЫРАЗИТЬ(УжеВыбрано.Опция КАК Справочник.Опции) КАК Опция
		//|ПОМЕСТИТЬ ВТ_УжеВыбрано
		//|ИЗ
		//|	&УжеВыбрано КАК УжеВыбрано
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		"ВЫБРАТЬ
		|	Renault_ТарифНаОпцииАвтомобилей.Опция КАК ОпцияСпр,
		|	Renault_ТарифНаОпцииАвтомобилей.НаименованиеОпции КАК НаименованиеОпции,
		|	Renault_ТарифНаОпцииАвтомобилей.ЦенаКлиентская,
		|	Renault_ТарифНаОпцииАвтомобилей.Опция.Артикул КАК КодОпции
		//|ПОМЕСТИТЬ ВТ_Опции
		|ИЗ
		|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних КАК Renault_ТарифНаОпцииАвтомобилей
		|ГДЕ
		|	Renault_ТарифНаОпцииАвтомобилей.Тариф = &Тариф
		|	И Renault_ТарифНаОпцииАвтомобилей.Базовая = ЛОЖЬ
		|	И Renault_ТарифНаОпцииАвтомобилей.Модель = &Модель
		|	И Renault_ТарифНаОпцииАвтомобилей.ВариантКомплектации = &ВариантКомплектации
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ЕСТЬNULL(ВТ_Опции.ОпцияСпр, ВТ_УжеВыбрано.Опция) КАК Опция,
		//|	ЕСТЬNULL(ВТ_Опции.НаименованиеОпции, ВТ_УжеВыбрано.Опция.Наименование) КАК НаименованиеОпции,
		//|	ВТ_Опции.ЦенаКлиентская КАК Цена,
		//|	ВТ_Опции.КодОпции КАК КодОпции
		//|ИЗ
		//|	ВТ_УжеВыбрано КАК ВТ_УжеВыбрано
		//|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Опции КАК ВТ_Опции
		//|		ПО (ВТ_Опции.ОпцияСпр = ВТ_УжеВыбрано.Опция)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеОпции";
	//КонецЕсли;

	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	ВыбранныеНебазовыеОпции.Загрузить(ТаблицаРезультат);

	//мОпций = Renault_ОбщегоНазначенияНаСервере.МассивОпцийПоСтроке(Опции,Версия,ТекущийТариф);
	//Для Каждого СтрокаОпции из мОпций Цикл 
	//	
	//	Если СтрокаОпции.Артикул = "PM" Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	СтрокаТЗОпций = ВыбранныеНебазовыеОпции.Добавить();
	//	СтрокаТЗОпций.Опция = СтрокаОпции;
	//	СтрокаТЗОпций.Выбран = Истина;
	//КонецЦикла;
	ОбновитьСпискиОборудованияАксессуаров();	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМоделиПриАктивизацииСтроки(Элемент)
	
	Если НеОбновлятьПриАктивизацииСтроки или Модель = Элемент.ТекущиеДанные.Модель Тогда
		Возврат;
	КонецЕсли;
	
	Модель = Элемент.ТекущиеДанные.Модель;
	ТипАвтомобиля = ПредопределенноеЗначение("Перечисление.DMS_ТипыАвтомобилей.VP");
	//Если Модель = "MAU" или Модель = "TFU" Тогда
	//	ТипАвтомобиля = ПредопределенноеЗначение("Перечисление..ТипыАвтомобилей.VU");
	//КонецЕсли;

	Элементы.ВариантСалона.СписокВыбора.Очистить();
	ВариантСалона = ПредопределенноеЗначение("Справочник.DMS_ВариантыСалона.ПустаяСсылка");
	Элементы.ЦветСалона.СписокВыбора.Очистить();
	ЦветСалона = ПредопределенноеЗначение("Справочник.DMS_ЦветаСалона.ПустаяСсылка");
	Версия = ПредопределенноеЗначение("Справочник.ВариантыКомплектации.ПустаяСсылка");
	Цвет = ПредопределенноеЗначение("Справочник.Цвета.ПустаяСсылка");
	ОбновитьСписокКонфигураций (Модель);
	ОбновитьСписокЦветов(Модель);
	УстановитьОтборДляБазовыхОпции();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокКонфигураций(ТекМодель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	"""""""" КАК Комплектация,
	|	&ПустаяСтрока КАК Версия,
	|	"""""""" КАК Код,
	|	"""""""" КАК Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.НаименованиеПолное,
	|	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.Ссылка,
	|	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.Артикул,
	|	ПОДСТРОКА(Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.НаименованиеПолное, 0, 150)
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(
	|			,
	|			Тариф = &Тариф
	|				И Модель = &Модель) КАК Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних
	|ГДЕ
	|	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ДоступноКЗаказуВПроизводство = ИСТИНА ИЛИ НЕ &СкрыватьНедоступныеКЗаказу
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.УстановитьПараметр("Модель", ТекМодель);
	Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
	Запрос.УстановитьПараметр("ПустаяСтрока", Справочники.ВариантыКомплектации.ПустаяСсылка());
	Запрос.УстановитьПараметр("СкрыватьНедоступныеКЗаказу", Истина);//Не ЗначениеЗаполнено(Автомобиль));
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 1 Тогда
		Таблица.Очистить();
	Иначе
	КонецЕсли;
	
	ТаблицаКомплектаций.Загрузить(Таблица);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации.Ссылка КАК Версия
	//               |ИЗ
	//               |	РегистрСведений.ТарифНаКомплектацииАвтомобилей.СрезПоследних(
	//               |			,
	//               |			Тариф = &Тариф
	//               |				И Модель = &Модель) КАК ТарифНаКомплектацииАвтомобилейСрезПоследних
	//               |ГДЕ
	//               |	ТарифНаКомплектацииАвтомобилейСрезПоследних.ДоступноКЗаказуВПроизводство = ИСТИНА";
	//			   
	//Запрос.УстановитьПараметр("Модель", ТекМодель);
	//Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
	//Запрос.УстановитьПараметр("ПустаяСтрока", Справочники.ВариантыКомплектации.ПустаяСсылка());
	//
	//Таблица = Запрос.Выполнить().Выгрузить();
	//Если Таблица.Количество() = 1 Тогда
	//	//Таблица.Очистить();
	//Иначе
	//КонецЕсли;
	//
	//ТаблицаКомплектаций.Загрузить(Таблица);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЦветов(ТекМодель)
	
		Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ПустаяСтрока КАК Цвет,
	               |	"""" КАК Код,
	               |	"""" КАК ЦветНаименование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_ЦветаМоделей.Цвет,
	               |	Renault_ЦветаМоделей.Цвет.Артикул,
	               |	Renault_ЦветаМоделей.Цвет.Наименование
	               |ИЗ
	               |	РегистрСведений.Renault_ЦветаМоделей КАК Renault_ЦветаМоделей
	               |ГДЕ
	               |	Renault_ЦветаМоделей.Модель = &Модель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЦветНаименование";
	Запрос.УстановитьПараметр("Модель", ТекМодель);
	Запрос.УстановитьПараметр("ПустаяСтрока", Справочники.Цвета.ПустаяСсылка());
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 1 Тогда
		Таблица.Очистить();
	КонецЕсли;
	
	ТаблицаЦветов.Загрузить(Таблица);

	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЦветаМоделей.Цвет КАК Цвет
	//               |ИЗ
	//               |	РегистрСведений.ЦветаМоделей КАК ЦветаМоделей
	//               |ГДЕ
	//               |	ЦветаМоделей.Модель = &Модель
	//               |	И ЦветаМоделей.Цвет.ПометкаУдаления = ЛОЖЬ";
	//Запрос.УстановитьПараметр("Модель", ТекМодель);
	//Запрос.УстановитьПараметр("ПустаяСтрока", Справочники.Цвета.ПустаяСсылка());
	//
	//Таблица = Запрос.Выполнить().Выгрузить();
	////Если Таблица.Количество() = 1 Тогда
	////	Таблица.Очистить();
	////КонецЕсли;
	//
	//ТаблицаЦветов.Загрузить(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомплектацийПриАктивизацииСтроки(Элемент)
	
	Если НеОбновлятьПриАктивизацииСтроки Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные <> Неопределено и Версия <> Элемент.ТекущиеДанные.Версия Тогда
		Версия = Элемент.ТекущиеДанные.Версия; 
		Элементы.ЦветСалона.СписокВыбора.Очистить();
		ЦветСалона = ПредопределенноеЗначение("Справочник.DMS_ЦветаСалона.ПустаяСсылка");
		Элементы.ВариантСалона.СписокВыбора.Очистить();
		ВариантСалона = ПредопределенноеЗначение("Справочник.DMS_ВариантыСалона.ПустаяСсылка");
		ОбновитьСпискиОборудованияАксессуаров();
		ЗаполнитьВариантыСалонаИЦвет();
		Если Элементы.ВариантСалона.СписокВыбора.Количество() Тогда
			ВариантСалона = Элементы.ВариантСалона.СписокВыбора[0].Значение;
		КонецЕсли;
		Если Элементы.ЦветСалона.СписокВыбора.Количество() Тогда
			ЦветСалона = Элементы.ЦветСалона.СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;
	УстановитьОтборДляБазовыхОпции();	
	
	
КонецПроцедуры     

&НаКлиенте
Процедура ОбработчикСменыВариантаКомплектации () Экспорт 
	ЗаполнитьВариантыСалонаИЦвет();	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВариантыСалонаИЦвет()
	
	// +++ Кудинов И.  19.08.2016
	ПараметрыВызоваСервера = Новый Структура;
	ПараметрыВызоваСервера.Вставить("Модель", ПолучитьАртикул(Модель));
	ПараметрыВызоваСервера.Вставить("Версия", ПолучитьАртикул(Версия));
	РезультатПолученияДопИнформации = ВыполнитьЗапрос (ПараметрыВызоваСервера);
	Если РезультатПолученияДопИнформации.ФоновоеЗадание Тогда
		Renault_ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
		ФормаДлительнойОперации = Renault_ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);
	Иначе
		ОбработатьРезультатВыполненияЗадания();
	КонецЕсли;

	
	Возврат;
	// --- Кудинов И.  19.08.2016
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапрос (ПараметрыВызоваСервера)
	РезультатФоновогоЗадания = Renault_ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"DMS_ОбменДаннымиСДилерскимПорталом.GetVersionsInteriorColor", ПараметрыВызоваСервера);
	Результат = Новый Структура;
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		Результат.Вставить("ФоновоеЗадание", Ложь);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	Иначе 
		Результат.Вставить("ФоновоеЗадание", Истина);
		Результат.Вставить("ФоновоеЗаданиеИдентификатор", РезультатФоновогоЗадания.ИдентификаторЗадания);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = Renault_ДлительныеОперации.ЗаданиеВыполнено(РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);

	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор Тогда
				Renault_ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОбработатьРезультатВыполненияЗадания();
		Иначе
		Renault_ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыполненияЗадания()
	
	сОтвет = ПолучитьИзВременногоХранилища(РезультатПолученияДопИнформации.АдресХранилища);
	
	Если сОтвет.Свойство("Ошибка") и сОтвет.Ошибка Тогда
		Ответ = Вопрос ("Отправка заявки не завершена, поставить заявку в очередь на отправку?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЭтаФорма.Записать();
			ЭтаФорма.Закрыть();
		иначе
			ЭтаФорма.Закрыть();
		КонецЕсли;
	Иначе
		
		ВариантСалона_ = ПолучитьСсылкуПоАртикулу(сОтвет.ВариантСалона, "DMS_ВариантыСалона");
		Элементы.ВариантСалона.РежимВыбораИзСписка = Истина;
		Элементы.ВариантСалона.СписокВыбора.ЗагрузитьЗначения(ВариантСалона_);  		
		
		ЦветСалона_ = ПолучитьСсылкуПоАртикулу(сОтвет.ЦветСалона, "DMS_ЦветаСалона");
		Элементы.ЦветСалона.РежимВыбораИзСписка = Истина;
		Элементы.ЦветСалона.СписокВыбора.ЗагрузитьЗначения(ЦветСалона_);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАртикул(ДанныеФормы)
	Возврат ДанныеФормы.Артикул;
КонецФункции // ПолучитьАртикул()

&НаСервереБезКонтекста
Функция ПолучитьСсылкуПоАртикулу(Артикулы, Справочник)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	т.Ссылка
		|ИЗ
		|	Справочник."+Справочник+" КАК т
		|ГДЕ
		|	т.Артикул В(&Артикул)";
	
	Запрос.УстановитьПараметр("Артикул", Артикулы);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат РезультатЗапроса;

КонецФункции // ПолучитьСсылкуПоАртикулу()


&НаКлиенте
Процедура ТаблицаЦветовПриАктивизацииСтроки(Элемент)
	
	Если НеОбновлятьПриАктивизацииСтроки Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Цвет = Элемент.ТекущиеДанные.Цвет;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БазовыеОпцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеНебазовыеОпцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДляБазовыхОпции ()
	Renault_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(БазовыеОпции,"Модель",Модель,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Renault_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(БазовыеОпции,"ВариантКомплектации",Версия,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Renault_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(БазовыеОпции,"Тариф",ТекущийТариф,ВидСравненияКомпоновкиДанных.Равно,,Истина);
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиОборудованияАксессуаров()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Тариф", ТекущийТариф);
	Запрос.УстановитьПараметр("УжеВыбрано", ВыбранныеНебазовыеОпции.Выгрузить());
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", Версия);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УжеВыбрано.Выбран,
	|	УжеВыбрано.Опция
	|ПОМЕСТИТЬ ВТ_УжеВыбрано
	|ИЗ
	|	&УжеВыбрано КАК УжеВыбрано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифНаОпцииАвтомобилей.Опция КАК ОпцияСпр,
	|	ТарифНаОпцииАвтомобилей.ЦенаКлиентская,
	|	ТарифНаОпцииАвтомобилей.Опция.Артикул КАК КодОпции
	|ПОМЕСТИТЬ ВТ_Опции
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних КАК ТарифНаОпцииАвтомобилей
	|ГДЕ
	|	ТарифНаОпцииАвтомобилей.Тариф = &Тариф
	|	И ТарифНаОпцииАвтомобилей.Базовая = ЛОЖЬ
	|	И ТарифНаОпцииАвтомобилей.Модель = &Модель
	|	И ТарифНаОпцииАвтомобилей.ВариантКомплектации = &ВариантКомплектации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Опции.ОпцияСпр КАК Опция,
	|	ВТ_Опции.ЦенаКлиентская КАК Цена,
	|	ЕСТЬNULL(ВТ_УжеВыбрано.Выбран, ЛОЖЬ) КАК Выбран,
	|	ВТ_Опции.КодОпции КАК КодОпции
	|ИЗ
	|	ВТ_Опции КАК ВТ_Опции
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УжеВыбрано КАК ВТ_УжеВыбрано
	|		ПО ВТ_Опции.ОпцияСпр = ВТ_УжеВыбрано.Опция
	|ГДЕ
	|	ВТ_Опции.ОпцияСпр.Артикул <> ""PM""";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ВыбранныеНебазовыеОпции.Загрузить(ТаблицаРезультат);
	СформироватьСтрокуОпций();
КонецПроцедуры

&НаСервере
Процедура СформироватьСтрокуОпций ()
	ТаблицаОций = РеквизитФормыВЗначение("ВыбранныеНебазовыеОпции");
	Отбор = Новый Структура;
	Отбор.Вставить("Выбран",Истина);
	мОпций = ТаблицаОций.НайтиСтроки(Отбор);
	Опции = "";
	Если мОпций.Количество () Тогда 
		Для Каждого СтрокаОпции из мОпций Цикл
			Опции = Опции + СтрокаОпции.КодОпции +" ";
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеНебазовыеОпцииВыбранПриИзменении(Элемент)
	СформироватьСтрокуОпций();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если Не ЗначениеЗаполнено(ТипАвтомобиля) тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "ТипАвтомобиля";
		Сообщение.Текст = "Поле не заполнено";
		Сообщение.УстановитьДанные(ТипАвтомобиля);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Модель) и ЗначениеЗаполнено(Версия) и ЗначениеЗаполнено(Цвет) Тогда
		сОтвет = Новый Структура;
		сОтвет.Вставить("Модель",Модель);
		сОтвет.Вставить("Версия", Версия);
		сОтвет.Вставить("Цвет", Цвет);
		сОтвет.Вставить("Опции", Опции);
		сОтвет.Вставить("Салон", ВариантСалона);
		сОтвет.Вставить("ЦветСалона", ЦветСалона);
		сОтвет.Вставить("ТипАвтомобиля", ТипАвтомобиля);
	Иначе
		сОтвет = Неопределено;
	КонецЕсли;
		
	Закрыть(сОтвет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	//Если ЗначениеЗаполнено(Модель) и ЗначениеЗаполнено(Версия) Тогда
	//    ЗаполнитьВариантыСалонаИЦвет();
	//КонецЕсли;
	УстановитьОтборДляБазовыхОпции();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	НеОбновлятьПриАктивизацииСтроки = Истина; 
	ОбновитьСписокМоделей(); 
	ОбновитьСписокКонфигураций (Модель);
	ОбновитьСписокЦветов(Модель); 
	ОбновитьСпискиОборудованияАксессуаров();
	
	Если ЗначениеЗаполнено(Модель) и ЗначениеЗаполнено(Версия) Тогда
		УстановитьВыбранныеМодельИВерсии();
		//ЗаполнитьВариантыСалонаИЦвет();
	КонецЕсли;
	
	НеОбновлятьПриАктивизацииСтроки = Ложь;
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьВыбранныеМодельИВерсии ()
	МассивСтрок = ТаблицаМодели.НайтиСтроки(Новый Структура("Модель", Модель));
    Если МассивСтрок.Количество() > 0 Тогда
        Элементы.ТаблицаМодели.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
	КонецЕсли;
	МассивСтрок = ТаблицаКомплектаций.НайтиСтроки(Новый Структура("Версия", Версия));
    Если МассивСтрок.Количество() > 0 Тогда
        Элементы.ТаблицаКомплектаций.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
	КонецЕсли;
	МассивСтрок = ТаблицаЦветов.НайтиСтроки(Новый Структура("Цвет", Цвет));
    Если МассивСтрок.Количество() > 0 Тогда
        Элементы.ТаблицаЦветов.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
КонецПроцедуры


&НаКлиенте
Процедура МодельНаименованиеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура КомплектацияНаименованиеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнитьВариантыСалонаИЦвет()
	Если ЗначениеЗаполнено(Модель) и ЗначениеЗаполнено(Версия) Тогда
	    ЗаполнитьВариантыСалонаИЦвет();
	КонецЕсли;
КонецПроцедуры // Зап()


&НаКлиенте
Процедура ВариантСалонаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
